In [2]:
import pandas as pd
import numpy as np

In [16]:
cars_specs = pd.DataFrame({
    "car_id": np.arange(1, 6),
    "make": np.random.choice(["Toyota", "Ford", "BMW", "Honda"], 5),
    "year": np.random.randint(2015, 2023, 5),
    "engine_liters": np.round(np.random.uniform(1.4, 3.5, 5), 1)
})

cars_sales = pd.DataFrame({
    "car_id": np.arange(3, 8),
    "price_usd": np.random.randint(15000, 45000, 5),
    "mileage_km": np.random.randint(5000, 120000, 5)
})

cars_specs

   car_id   make  year  engine_liters
0       1    BMW  2016            3.2
1       2    BMW  2019            3.1
2       3   Ford  2020            1.8
3       4  Honda  2015            3.3
4       5   Ford  2019            2.5

In [17]:
cars_sales

   car_id  price_usd  mileage_km
0       3      41105       28776
1       4      25230       35080
2       5      30707       71842
3       6      36976       66373
4       7      26494       11776

In [18]:
merged = pd.merge(cars_specs, cars_sales)
merged

   car_id   make  year  engine_liters  price_usd  mileage_km
0       3   Ford  2020            1.8      41105       28776
1       4  Honda  2015            3.3      25230       35080
2       5   Ford  2019            2.5      30707       71842

In [19]:
merged = pd.merge(cars_specs, cars_sales, how='outer')
merged

   car_id   make    year  engine_liters  price_usd  mileage_km
0       1    BMW  2016.0            3.2        NaN         NaN
1       2    BMW  2019.0            3.1        NaN         NaN
2       3   Ford  2020.0            1.8    41105.0     28776.0
3       4  Honda  2015.0            3.3    25230.0     35080.0
4       5   Ford  2019.0            2.5    30707.0     71842.0
5       6    NaN     NaN            NaN    36976.0     66373.0
6       7    NaN     NaN            NaN    26494.0     11776.0

In [20]:
merged = pd.merge(cars_specs, cars_sales, how='left')
merged

   car_id   make  year  engine_liters  price_usd  mileage_km
0       1    BMW  2016            3.2        NaN         NaN
1       2    BMW  2019            3.1        NaN         NaN
2       3   Ford  2020            1.8    41105.0     28776.0
3       4  Honda  2015            3.3    25230.0     35080.0
4       5   Ford  2019            2.5    30707.0     71842.0

In [26]:
merged = pd.merge(cars_specs, cars_sales, left_on='car_id', right_on='car_id')
merged

   car_id   make  year  engine_liters  price_usd  mileage_km
0       3   Ford  2020            1.8      41105       28776
1       4  Honda  2015            3.3      25230       35080
2       5   Ford  2019            2.5      30707       71842

In [37]:
cars_specs = cars_specs.set_index('car_id')
cars_specs

         make  year  engine_liters
car_id
1         BMW  2016            3.2
2         BMW  2019            3.1
3        Ford  2020            1.8
4       Honda  2015            3.3
5        Ford  2019            2.5

In [40]:
merged = pd.merge(cars_specs, cars_sales, left_index=True, right_on='car_id', how='inner')
merged

    make  year  engine_liters  car_id  price_usd  mileage_km
0   Ford  2020            1.8       3      41105       28776
1  Honda  2015            3.3       4      25230       35080
2   Ford  2019            2.5       5      30707       71842